'use strict';
(function () {
  window.const = {
    KeyCode: {
      ENTER: 'Enter',
      ESC: 'Escape'
    },
    COMMENTS: [
      'Всё отлично!',
      'В целом всё неплохо. Но не всё.',
      'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
      'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
      'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
      'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
    ],
    COMMENTATORS: [
      'Люсинда Гомес',
      'Чау Расма',
      'Нил Армстронг',
      'Ахмед Аль Ахмед',
      'Петр Первый',
      'Вам Лучше Не Знать'
    ],
    DESCRIPTION: [
      'Прекрасный вид прекрасного вида',
      'Зачётно провели время',
      'Расслабляемся по-полной',
      'Лучше просто не бывает',
      'Эти воспоминания ничем не стереть',
      'Так просто потому что можем'
    ],
    MIN: 0,
    POSTS_COUNT: 25,
    MIN_LIKES: 15,
    MAX_LIKES: 200,
    MIN_AVATAR: 1,
    MAX_AVATAR: 6,
    MIN_COMMENTS: 1,
    MIN_ZOOM: 25,
    STEP_ZOOM: 25,
    MAX_ZOOM: 100,
    DEFAULT_PIN_POSITION: '455',
    DEFAULT_LINE_WIDTH: '455',
    MAX_PIN_POSITION: '455',
    BLUR_VALUE: 3,
    BRIGHTNESS_VALUE: 2,
    BRIGHTNESS_CORRECTION: 1
  };
})();
